<template>
    <div class="lk-welcome">
        <div class="container-fluid">
            <div class="row justify-content-center">
                <div class="col-lg-10">
                    <div class="lk-welcome-block">
                        <span>Добро пожаловать, <br> User</span>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <div class="lk-content">
        <div class="container-fluid">
            <div class="row justify-content-center">
                <div class="col-lg-4">
                    <div class="lk-block-title">
                        <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.9524 0C5.80535 0 0 5.80535 0 12.9524C0 20.0995 5.80535 25.9049 12.9524 25.9049C20.0995 25.9049 25.9049 20.0995 25.9049 12.9524C25.9049 5.80535 20.0995 0 12.9524 0ZM12.9524 1.12643C19.4902 1.12643 24.7784 6.41469 24.7784 12.9524C24.7784 19.4902 19.4902 24.7784 12.9524 24.7784C6.41469 24.7784 1.12643 19.4902 1.12643 12.9524C1.12643 6.41469 6.41469 1.12643 12.9524 1.12643ZM12.9524 5.06851C12.0198 5.06851 11.263 5.82508 11.263 6.75794C11.263 7.69057 12.0198 8.44737 12.9524 8.44737C13.8851 8.44737 14.6419 7.69057 14.6419 6.75794C14.6419 5.82508 13.8851 5.06851 12.9524 5.06851ZM10.6998 10.6998V11.8262H11.8262V19.1472H10.6998V20.2734H15.2051V19.1472H14.0786V10.6998H10.6998Z" fill="black"/>
                        </svg>
                        <span> Последние новости </span>
                    </div>
                    <div class="lk-block-news lk-monbox">
                        <div class="news-date"> 05.11.2020 </div>
                        <div class="news-name"> Обновлённый личный кабинет </div>
                        <div class="news-desc"> 
                            Новый и приятный дизайн. Оптимизация
                            кода со стороны Front и Back end’a 
                        </div>
                    </div>
                    <div class="lk-block-news lk-monbox">
                        <div class="news-date"> 05.11.2020 </div>
                        <div class="news-name"> 
                            Новый,красивый и уникальный
                            поезд с нашим дизайном 
                        </div>
                        <div class="news-desc"> 
                            Добавили состав AURORA M1. Для установки
                            перезайдите в лаунчер и обновите файлы
                            игры
                        </div>
                    </div>
                </div>
                <div class="col-lg-4 offset-1">
                    <div class="lk-block-title">
                        <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.9524 0C5.80535 0 0 5.80535 0 12.9524C0 20.0995 5.80535 25.9049 12.9524 25.9049C20.0995 25.9049 25.9049 20.0995 25.9049 12.9524C25.9049 5.80535 20.0995 0 12.9524 0ZM12.9524 1.12643C19.4902 1.12643 24.7784 6.41469 24.7784 12.9524C24.7784 19.4902 19.4902 24.7784 12.9524 24.7784C6.41469 24.7784 1.12643 19.4902 1.12643 12.9524C1.12643 6.41469 6.41469 1.12643 12.9524 1.12643ZM12.9524 5.06851C12.0198 5.06851 11.263 5.82508 11.263 6.75794C11.263 7.69057 12.0198 8.44737 12.9524 8.44737C13.8851 8.44737 14.6419 7.69057 14.6419 6.75794C14.6419 5.82508 13.8851 5.06851 12.9524 5.06851ZM10.6998 10.6998V11.8262H11.8262V19.1472H10.6998V20.2734H15.2051V19.1472H14.0786V10.6998H10.6998Z" fill="black"/>
                        </svg>
                        <span> Мануал по новому ЛК </span>
                    </div>
                    <div class="lk-block-insruct">
                        <svg width="28" height="32" viewBox="0 0 28 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.544922 0.160522V31.9267L1.75106 31.2231L26.3548 16.7472L27.5359 16.0436L26.3548 15.34L1.75106 0.864446L0.544922 0.160522ZM2.15321 2.97527L24.3444 16.0436L2.15321 29.112V2.97527Z" fill="white"/>
                        </svg>                            
                    </div>
                    <div class="lk-block-title">
                        <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.9524 0C5.80535 0 0 5.80535 0 12.9524C0 20.0995 5.80535 25.9049 12.9524 25.9049C20.0995 25.9049 25.9049 20.0995 25.9049 12.9524C25.9049 5.80535 20.0995 0 12.9524 0ZM12.9524 1.12643C19.4902 1.12643 24.7784 6.41469 24.7784 12.9524C24.7784 19.4902 19.4902 24.7784 12.9524 24.7784C6.41469 24.7784 1.12643 19.4902 1.12643 12.9524C1.12643 6.41469 6.41469 1.12643 12.9524 1.12643ZM12.9524 5.06851C12.0198 5.06851 11.263 5.82508 11.263 6.75794C11.263 7.69057 12.0198 8.44737 12.9524 8.44737C13.8851 8.44737 14.6419 7.69057 14.6419 6.75794C14.6419 5.82508 13.8851 5.06851 12.9524 5.06851ZM10.6998 10.6998V11.8262H11.8262V19.1472H10.6998V20.2734H15.2051V19.1472H14.0786V10.6998H10.6998Z" fill="black"/>
                        </svg>
                        <span> Преимущества </span>
                    </div>
                    <div class="lk-advan">
                        <ul>
                            <li 
                                v-for="item in advanItem"
                                :key="item.id"    
                            >   
                                <img src="../../assets/img/lk/icon/icon_vector3.png">
                                <span> {{ item.name }} </span> 
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>


<script>
export default {
    data() {
        return {
            advanItem: [
                {id: '1', name: 'Новые возможности'},
                {id: '2', name: 'Удобный и понятный интерфейс'},
                {id: '3', name: 'Большой функционал'},
                {id: '4', name: 'Авторский дизайн от Buublexx.'},
            ],
        }
    }
}
</script>